applications/sim-transient-compressible/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu             nu [0 2 -1 0 0 0 0]  1;
mu             mu [1 -1 -1 0 0 0 0]  1;
rho0            rho0 [1 -3 0 0 0 0 0] 1.;
beta            beta [-1 1 2 0 0 0 0] 1.e-8;
p0            beta [1 -1 -2 0 0 0 0] 0.;

// ************************************************************************* //
