applications/sim-transient-compressible/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    "(p|p_rgh)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1.e-10;
        relTol          1.e-10;
    }

    "(pFinal|p_rghFinal)"
    {
        $p;
        tolerance       1e-12;
        relTol          0.;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1.e-10;
        relTol          1.e-10;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-10;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1000;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        "(U|k|epsilon|p)"
        {
            relTol          0;
            tolerance       1.e-7;
        }
    }

}

relaxationFactors
{
    fields
    {
        p               0.3;
        p_rgh           0.3;
        pFinal   0.3;
    }
    equations
    {
        U               0.7;
        UFinal   0.7;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
